#+Title: Trabalho LP
#+Date: 2016-11-15
#+Author: Fernanda e Yuri

Segunda Representação do Projeto
(rel tk filho1 filho2 ...)

#+BEGIN_SRC scheme
(define (search source initial)
  (if (empty? source)
      empty
  (let ((id (list-ref (car source) 0))
        (form (list-ref (car source) 1))
        (class (list-ref (car source) 2))
        (head (list-ref (car source) 3))
        (rel (list-ref (car source) 4)))
             (if  (equal? head initial)
                  (remove-duplicates (list rel(list class form)(search source id) (search lista id)))
                 (search  (cdr source) initial)))))

(define (search-f lista)
  (search lista "0") )

(define lista '(("1" "Disney" "nnp" "2" "nsubj")
 ("2" "acquired" "verb" "0" "root") 
 ("3" "the" "art" "4" "det") 
 ("4" "Pixar" "nnp" "2" "dobj")))

(search-f lista)
#+END_SRC

#+RESULTS:
: '("root" ("verb" "acquired") ("dobj" ("nnp" "Pixar") () ("det" ("art" "the") ())) ("nsubj" ("nnp" "Disney") ()))

